app/controllers/images_controller.rb

  def index
    @images = Image.all
---
SELECT "images".* FROM "images" ORDER BY "images"."id" DESC

  def show
    @image = Image.find(params[:id])
---
SELECT  "images".* FROM "images" WHERE "images"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]