app/controllers/images_controller.rb

SELECT "images".* FROM "images" WHERE "images"."nsfw" = $1 ORDER BY "images"."id" ASC  [["nsfw", false]]
---
  def index
    @images = Image.where(nsfw: false).order(id: :asc)

SELECT "images".* FROM "images" WHERE "images"."nsfw" = $1 ORDER BY "images"."id" ASC  [["nsfw", true]]
---
  def index_nsfw
    @images = Image.where(nsfw: true).order(id: :asc)

SELECT  "images".* FROM "images" WHERE (images.id < 16 ) ORDER BY created_at DESC LIMIT $1  [["LIMIT", 1]]
---
  def show_router
    @image = Image.find(params[:id])