app/models/image.rb

  def self.get_previous_image(current_image)
    Image.where("images.id < ? ", current_image.id).order('created_at asc').last
---
SELECT  "images".* FROM "images" WHERE (images.id < 11 ) ORDER BY created_at DESC LIMIT $1  [["LIMIT", 1]]

  def self.get_next_image(current_image)
    Image.where("images.id > ? ", current_image.id).order('created_at asc').first
---
SELECT  "images".* FROM "images" WHERE (images.id > 9 ) ORDER BY created_at asc LIMIT $1  [["LIMIT", 1]]