app/views/images/show_nsfw.html.erb

SELECT  "images".* FROM "images" ORDER BY "images"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
<center><br>
  <%= link_to "≤", Image.first, class: "nav_btn" %>

SELECT  "images".* FROM "images" ORDER BY "images"."id" DESC LIMIT $1  [["LIMIT", 1]]
---
  <%= link_to ">", Image.get_next_image(@image), class: "nav_btn" %>
  <%= link_to "≥", Image.last, class: "nav_btn" %>