app/views/images/show_nsfw.html.erb

<center><br>
  <%= link_to "≤", Image.where(nsfw: true).first, class: "nav_btn" %>
---
SELECT  "images".* FROM "images" WHERE "images"."nsfw" = $1 ORDER BY "images"."id" ASC LIMIT $2  [["nsfw", true], ["LIMIT", 1]]

  <%= link_to ">", Image.where(nsfw: true).get_next_image(@image), class: "nav_btn" %>
  <%= link_to "≥", Image.where(nsfw: true).last, class: "nav_btn" %>
---
SELECT  "images".* FROM "images" WHERE "images"."nsfw" = $1 ORDER BY "images"."id" DESC LIMIT $2  [["nsfw", true], ["LIMIT", 1]]